In [1]:
import pandas as pd

###############
# EJERCICIO 1 #
###############

# Ruta del archivo csv
archivo_csv = 'C:\\Repo\\CE-Python\\Analisis de datos\\T2\\Ejercicios\\ventas_utf8.csv'

# Abrimos el csv para lectura
df = pd.read_csv(archivo_csv , encoding='utf-8')

# Mostramos las 5 primeras filas
primeras_filas = df.head()

In [2]:
# Sumamos los valores nulos que hay en cada columna
valores_nulos = df.isnull().sum()

In [3]:
# Imprimimos la cabecera y el valor de nulos
primeras_filas, valores_nulos

(        Fecha    Producto  Cantidad  Precio_Unitario   Total     Ciudad  \
 0  2023-01-15    Portátil       2.0              800  1600.0     Madrid
 1  2023-01-16      Tablet       1.0              300   300.0  Barcelona
 2  2023-01-17  Smartphone      -3.0              500 -1500.0   Valencia
 3  2023-01-18     Monitor       5.0              200  1000.0     Madrid
 4  2023-01-19     Teclado       NaN               50     NaN    Sevilla

    Descuento
 0       0.10
 1        NaN
 2       0.20
 3       0.05
 4       0.00  ,
 Fecha              0
 Producto           0
 Cantidad           2
 Precio_Unitario    0
 Total              2
 Ciudad             2
 Descuento          2
 dtype: int64)

In [4]:
print("")
# Eliminar filas donde la columna "Ciudad" sea nula
df_limpio = df.dropna(subset=["Ciudad"])

# Eliminar filas donde la columna "Ciudad" sea nula
df_limpio = df.dropna(subset=["Ciudad"]).copy()

# Rellenar valores nulos en la columna "Descuento" con 0
df_limpio.loc[:, "Descuento"] = df_limpio["Descuento"].fillna(0)

# Reemplazar valores negativos en "Cantidad" y "Total" por sus valores absolutos
df_limpio.loc[:, "Cantidad"] = df_limpio["Cantidad"].abs()
df_limpio.loc[:, "Total"] = df_limpio["Total"].abs()

In [5]:
df_limpio.head()

,Fecha,Producto,Cantidad,Precio_Unitario,Total,Ciudad,Descuento
0,2023-01-15,Portátil,2.0,800,1600.0,Madrid,0.10
1,2023-01-16,Tablet,1.0,300,300.0,Barcelona,0.00
2,2023-01-17,Smartphone,3.0,500,1500.0,Valencia,0.20
3,2023-01-18,Monitor,5.0,200,1000.0,Madrid,0.05
4,2023-01-19,Teclado,NaN,50,NaN,Sevilla,0.00

In [6]:
# a. Crear una nueva columna llamada Precio_Final
df_limpio["Precio_Final"] = df_limpio["Total"] * (1 - df_limpio["Descuento"])

# b. Convertir la columna Fecha al tipo datetime
df_limpio["Fecha"] = pd.to_datetime(df_limpio["Fecha"])

In [7]:
df_limpio.head()

,Fecha,Producto,Cantidad,Precio_Unitario,Total,Ciudad,Descuento,Precio_Final
0,2023-01-15,Portátil,2.0,800,1600.0,Madrid,0.10,1440.0
1,2023-01-16,Tablet,1.0,300,300.0,Barcelona,0.00,300.0
2,2023-01-17,Smartphone,3.0,500,1500.0,Valencia,0.20,1200.0
3,2023-01-18,Monitor,5.0,200,1000.0,Madrid,0.05,950.0
4,2023-01-19,Teclado,NaN,50,NaN,Sevilla,0.00,NaN

In [8]:
ventas_madrid = df_limpio[df_limpio["Ciudad"] == "Madrid"]
promedio_precio_madrid = ventas_madrid["Precio_Final"].mean()
print("Promedio de Precio_Final en Madrid:", promedio_precio_madrid)

Promedio de Precio_Final en Madrid: 872.9166666666666

In [9]:
cantidad_por_producto = df_limpio.groupby("Producto")["Cantidad"].sum()
print(cantidad_por_producto)

Producto
Auriculares     4.0
Impresora       3.0
Monitor         6.0
Portátil        5.0
Ratón          25.0
Smartphone      8.0
Tablet          3.0
Teclado         8.0
Name: Cantidad, dtype: float64

In [10]:
Q1 = df_limpio["Total"].quantile(0.25)
Q3 = df_limpio["Total"].quantile(0.75)
IQR = Q3 - Q1

# Limites para detectar outliers
limite_inferior = Q1 - 1.5 * IQR
limite_superior = Q3 + 1.5 * IQR

# Filtrar filas atípicas
outliers_total = df_limpio[(df_limpio["Total"] < limite_inferior) | (df_limpio["Total"] > limite_superior)]
print(outliers_total)

        Fecha    Producto  Cantidad  Precio_Unitario   Total    Ciudad  \
10 2023-01-25  Smartphone       5.0              600  3000.0  Valencia

    Descuento  Precio_Final
10        0.1        2700.0

In [11]:
df_limpio.to_csv("C:\\Repo\\CE-Python\\Analisis de datos\\T2\\Ejercicios\\ventas_limpias_Juan_Jose_Baeza_Lopez.csv", index=False)

In [12]:
###############
# EJERCICIO 2 #
###############

In [13]:
import json

with open('C:\\Repo\\CE-Python\\Analisis de datos\\T2\\Ejercicios\\encuestas.json', 'r', encoding='utf-8') as f:
    data = json.load(f)

# Convertir la lista bajo 'datos' a un DataFrame
df = pd.DataFrame(data['datos'])

print(df)

# Eliminar duplicados basándonos en la columna 'Nombre'
df = df.drop_duplicates(subset='Nombre')

# Rellenar valores nulos en 'Calificación_Curso' con la mediana
mediana = df['Calificación_Curso'].median()
df['Calificación_Curso'] = df['Calificación_Curso'].fillna(mediana)

            Nombre  Edad     Género         Carrera  Calificación_Curso  \
0        Ana López    22   Femenino      Ingeniería                 8.5
1      Carlos Ruiz    28  Masculino        Medicina                 6.0
2       Marta Díaz    19   Femenino         Derecho                 NaN
3        Ana López    22   Femenino      Ingeniería                 8.5
4     Jorge Méndez    40  Masculino  Administración                 4.5
5    Miguel Suarez    31  Masculino  Administración                 7.5
6  Ángeles Campeón    26   Femenino      Ingeniería                10.0
7      Luisa Pérez    34   Femenino        Medicina                 6.6

   Satisfacción
0             4
1             5
2             3
3             4
4             2
5             3
6             5
7             3

In [14]:
df.head()

,Nombre,Edad,Género,Carrera,Calificación_Curso,Satisfacción
0,Ana López,22,Femenino,Ingeniería,8.50,4
1,Carlos Ruiz,28,Masculino,Medicina,6.00,5
2,Marta Díaz,19,Femenino,Derecho,7.05,3
4,Jorge Méndez,40,Masculino,Administración,4.50,2
5,Miguel Suarez,31,Masculino,Administración,7.50,3

In [15]:
print(df)

            Nombre  Edad     Género         Carrera  Calificación_Curso  \
0        Ana López    22   Femenino      Ingeniería                8.50
1      Carlos Ruiz    28  Masculino        Medicina                6.00
2       Marta Díaz    19   Femenino         Derecho                7.05
4     Jorge Méndez    40  Masculino  Administración                4.50
5    Miguel Suarez    31  Masculino  Administración                7.50
6  Ángeles Campeón    26   Femenino      Ingeniería               10.00
7      Luisa Pérez    34   Femenino        Medicina                6.60

   Satisfacción
0             4
1             5
2             3
4             2
5             3
6             5
7             3

In [16]:
import numpy as np

# Discretiza la columna Edad en categorías
bins = [17, 25, 35, 60]
labels = ['Joven', 'Adulto Joven', 'Adulto']
df['Categoría_Edad'] = pd.cut(df['Edad'], bins=bins, labels=labels, right=True)

# Crea la columna Rendimiento según Calificación_Curso
conditions = [
    df['Calificación_Curso'] < 5,
    (df['Calificación_Curso'] >= 5) & (df['Calificación_Curso'] < 7),
    df['Calificación_Curso'] >= 7
]
choices = ['Bajo', 'Medio', 'Alto']
df['Rendimiento'] = np.select(conditions, choices)

print(df[['Edad', 'Categoría_Edad', 'Calificación_Curso', 'Rendimiento']])

   Edad Categoría_Edad  Calificación_Curso Rendimiento
0    22          Joven                8.50        Alto
1    28   Adulto Joven                6.00       Medio
2    19          Joven                7.05        Alto
4    40         Adulto                4.50        Bajo
5    31   Adulto Joven                7.50        Alto
6    26   Adulto Joven               10.00        Alto
7    34   Adulto Joven                6.60       Medio

In [17]:
# Promedio de Satisfacción por Carrera, ordenado de mayor a menor
promedio_satisfaccion = df.groupby('Carrera')['Satisfacción'].mean().sort_values(ascending=False)
promedio_satisfaccion = promedio_satisfaccion.reset_index() 
promedio_satisfaccion.columns = ['Carrera', 'Promedio_Satisfacción']

print(promedio_satisfaccion)

print("")

# Filtrar estudiantes con Rendimiento "Alto" y mostrar la frecuencia de Satisfacción
frecuencia_satisfaccion_alto = df[df['Rendimiento'] == 'Alto']['Satisfacción'].value_counts().sort_index()
frecuencia_satisfaccion_alto = frecuencia_satisfaccion_alto.reset_index() 
frecuencia_satisfaccion_alto.columns = ['Satisfacción', 'Frecuencia']

print(frecuencia_satisfaccion_alto)

          Carrera  Promedio_Satisfacción
0      Ingeniería                    4.5
1        Medicina                    4.0
2         Derecho                    3.0
3  Administración                    2.5

   Satisfacción  Frecuencia
0             3           2
1             4           1
2             5           1